docs/org/configuration.org
#+AUTHOR:   Sina Samavati
#+EMAIL:    sina.samv@gmail.com
#+TITLE:    Configuration

/*NOTE*: Read this if you want to pass the ~App~ name as the second argument to/
/~leptus:start_listener/2~./

/Leptus configuration file must be named ~leptus.config~, and it must be put in/
/the ~priv~ directory of the ~App~ application./

* Sections
  :PROPERTIES:
  :CUSTOM_ID: sections
  :END:

** handlers
   :PROPERTIES:
   :CUSTOM_ID: handlers
   :END:

   In ~leptus.config~, request handlers should be defined as follows:
   ~{handlers, [{HostMatch, [{module(), State :: any()}]}]}.~

   Please refer to [[file:leptus.org::#types][leptus module types]] for further details
   on types.

** options
   :PROPERTIES:
   :CUSTOM_ID: options
   :END:

   By default, Leptus runs on ~127.0.0.1:808-0~, but you can override them:

   #+BEGIN_SRC
   {options,
    [
      {ip, inet:ip_address()},
      {port, inet:port_number()}
    ]
   }.
   #+END_SRC

   Note: For an HTTPS listener, ~cacertfile~, ~certfile~ and ~keyfile~ are required:

   #+BEGIN_SRC
   {options,
    [
     {cacertfile, file:name()},
     {certfile, file:name()},
     {keyfile, file:name()}
    ]
   }.
   #+END_SRC

   Please refer to [[file:leptus.org::#types][leptus module types]] for further details
   on types.

* Example
  :PROPERTIES:
  :CUSTOM_ID: example
  :END:

  #+BEGIN_SRC
  %% leptus.config

  {options,
   [
    {ip, {0, 0, 0, -0}},
    {port, 444-4},
    {cacertfile, "ssl/ca.crt"},
    {certfile, "ssl/server.crt"},
    {keyfile, "ssl/server.key"}
   ]
  }.

  {handlers,
   [
    {'_',
     [{rq_handler-1, undefined_state},
      {rq_handler-2, [admin, dev]}]
    }
   ]
  }.
  #+END_SRC
